export const VALIDATIONS = {
  SignIn: {
    Email: "بريد الالكتروني مطلوب",
    ValidEmail: "ليس بريدًا إلكترونيًا صالحًا",
    EmailMax: "البريد الإلكتروني طويل جدًا (أقصى {{ length }} الأحرف المسموح بها)",
    Password: "كلمة المرور المطلوبة",
    PasswordMin: "البريد الإلكتروني طويل جدًا (أقصى {{ length }} الأحرف المسموح بها)",
    PasswordMax: "البريد الإلكتروني طويل جدًا (أقصى {{ length }} الأحرف المسموح بها)",
  },
  SignUp: {
    Name: "الاسم مطلوب",
    NameMin: "الاسم قصير جدًا (الحد الأدنى المطلوب هو {{length}} حرفًا)",
    NameMax: "الاسم طويل جدًا (الحد الأقصى المسموح به هو {{length}} حرفًا)",
    Password: "كلمة المرور المطلوبة",
    ValidPassword: "يجب أن يحتوي على رقم واحد وحرف كبير وحرف صغير وحرف خاص واحد و 8 أحرف على الأقل",
    PasswordMax: "كلمة المرور طويلة جدًا (الحد الأقصى المسموح به هو {{length}} حرفًا.)",
    PasswordMin: "كلمة المرور أقصر مما يجب (الحد الأدنى المطلوب هو {{length}} حرف.)",
    ConfirmPassword: "مطلوب تأكيد كلمة المرور!",
    PasswordNotMatched: "كلمة المرور غير متطابقة",
    MobileNumber: "رقم الجوال مطلوب!",
    NotValidMobileNumber: "يجب ألا يحتوي رقم الهاتف المحمول على جميع الأصفار",
    ValidMobileNumber: "يجب أن يحتوي رقم الهاتف المتحرك على (8 أرقام)."
  }
};
